// backend/test/config.ts
export const OLLAMA_API = 'http://localhost:11434/api/generate';
export const TEST_MODEL = 'qwen2.5:1.5b'; // یا هر مدل دیگری که دانلود کرده‌اید
// export const TEST_MODEL = 'qwen2.5-coder:3b'; // یا هر مدل دیگری که دانلود کرده‌اید


// ┌─────────┬────────────────────┬────────┬─────────────────────────────────────┐
// │ (index) │ name               │ sizeGB │ modifiedAt                          │
// ├─────────┼────────────────────┼────────┼─────────────────────────────────────┤
// │ 0       │ 'mistral:7b'       │ '4.07' │ '2026-07-23T04:14:38.9167101+03:30' │
// │ 1       │ 'qwen2.5-coder:7b' │ '4.36' │ '2026-07-23T04:13:05.6882352+03:30' │
// │ 2       │ 'qwen2.5:1.5b'     │ '0.92' │ '2026-07-23T04:12:17.7458343+03:30' │
// └─────────┴────────────────────┴────────┴─────────────────────────────────────┘